= はじめに

//flushright{

2026年4月
Mutsumix

//}

本書をお手に取っていただきありがとうございます。

筆者は2024年4月からこれまで、自宅で水耕栽培という技術を使って野菜を栽培しています。
いかに効率よく、限られたスペースで定期的な収穫と収穫量の最大化を図るかについて考えてきました。

そのためにはデータをどう集めて分析するかが鍵になります。
種を蒔いた日や収穫した日の日付、収穫量、その間のセンサーから取得したデータや写真。
それぞれ記録には残っていたものの、保存先や形式がバラバラで活用できていなかったこれらの情報を、一元管理したいと考えました。

よしAndroidとBluetoothについて学んでアプリをつくろう。

それが本書を執筆しようとしたきっかけです。

== 本書で伝えたいこと

本書は三部構成になっています。

まず、アプリのOSであるAndroidについて書いた第一部。

スマートフォンと様々な機器を繋ぐ役目を果たす通信規格であるBluetoothについて書いた第二部。

そして、目的の植物育成管理アプリを作る第三部。

第一部と第二部は単に技術仕様についてなぞるのではなく、なぜそういったことになっているのか、というところまで掘り下げてみました。
第三部のアプリ作成の章では、AIを使ったアプリ開発について考え取り組んでいます。

「工夫」をすることで自分の抱えている課題を乗り越え、実現したい願いを叶える、それが「工学」でありエンジニアリングだと思います。

本書は「著者自身が自分の欲しいものを技術によってどのように作り上げたか」がテーマです。
そんな家庭菜園をDXしてみた過程を楽しみながら読み進めていただければ幸いです。

また、読者の皆さんも何かしら「こんなものがあったらいいなあ」と思っていることはあるかもしれません。この書籍が、皆さんのそういった興味に刺激を与えられるものであることを願っています。

== サポートページについて

本書で紹介した商品情報などのURLに誤りや更新があった場合は、こちらに最新の情報をまとめるようにします。
また付随する情報もまとめています。

報告用のフォームも用意していますので、気になったことがあればこちらからお知らせください。

//indepimage[support_page]

== 免責事項

本書に記載された内容は、情報の提供のみを目的としています。したがって、本書を用いたプログラムや周辺機器の使用は、必ずご自身の責任と判断によって行ってください。これらの情報によって生じた結果について、著者はいかなる責任も負いません。

また、本書はできるだけ正確を期すように努めましたが、不正確あるいは誤認と思われるような箇所がありましたら、必要に応じて適時改訂を行いますので、GitHub@<fn>{github}のIssueやPull Request、もしくはX@<fn>{x}で筆者までお知らせいただけますと幸いです。

//footnote[github][@<href>{https://github.com/Mutsumix/hydroponics_tbf20}]
//footnote[x][@<href>{https://x.com/Mutsumix_dev}]
